# CutExactlyHalf Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CutFailures..::..CutExactlyHalf Property
BuiltInFailures..::..CutFailures Class See Also
---
Can't cut in half. Move plane towards either end.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CutExactlyHalf { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CutExactlyHalf As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CutExactlyHalf {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CutFailures Class
Autodesk.Revit.DB Namespace